12/data/attachments/3135bede139cec0f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_7af5e51e-607d-4528-8368-f5a42eca0f1e</nif:username>
            <nif:friendToBeAdded>Thomas_toward_Actions_59651_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>